{
    "type": "manual_content",
    "lang": "de_DE",
    "category": "factions",
    "content": [
        {
            "content_type": "heading",
            "text": "Völker Info",
            "level": 1
        },
        {
            "content_type": "text",
            "text": "Willkommen im Kastellans Leitfaden der Völker und Kreaturen in Ancient Warfare. In der Welt von AW treffen Spieler auf viele verschiedene Zivilisationen und Stämme. Einige werden freundlich, andere neutral und andere feindselig sein."
        },
        {
            "content_type": "heading",
            "text": "Zivilisationen",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Zivilisierte Fraktionen werden als Zivilisationen eingestuft, da sie neben ihren Strukturen, die in normalen Weltregionen vorkommen auch ihre eigenen, nicht besetzten Städte und ummauerten Städte generieren werden. Noggs-Flagge (Smaragdgrün), Empire-Flagge (Lila), Witchbane-Flagge (Weiß), Xoltec-Flagge (Orange), Norska-Flagge (Hellblau), Sarkonids-Flagge (Rot)"
        },
        {
            "content_type": "heading",
            "text": "Stämme",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Stammes-Fraktionen werden als Stammesangehörige eingestuft, weil sie keine unbesetzte Städte oder ummauerten Städte erzeugen. \nZimba-Flagge (Gelb) \nKongs-Flagge (Dunkelgrün) \nBuffloka-Flagge (Grün) \nPiraten-Flagge (Ocker) \nBriganden-Flagge (Braun) \nOrcs-Flagge (Dunkelgrau) \nDemons-Flagge (Scharlachrot) \nDie Untoten-Flagge (Hellgrau) \nDie Bosheit (Übel)-Flagge (Schwarz) \nThe Guardians (Good) -Flagge (Hellgrün)"
        },
        {
            "content_type": "heading",
            "text": "Norska",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flaggenfarbe (hellblau) \nNorska-Krieger sind hart wie Stahl und wohnen in den kalten Schneeländern des Nordens. Ihre Siedlungen sind gut befestigt und verteidigt, mit Wachtürmen und Leuchtfeuertürmen, und ihre Städte sind mit festen Baumstämmen ummauert. \nNorska-Adlige- Jarls genannt - haben die Jarls-Hallen mit einem Schatz gefüllt; Die Berserker-Krieger, die ihnen dienen, sind im Kampf grausam und können Schaden erleiden, der jeden normalen Mann fünfmal töten würde. Sie sterben bei tapferen Taten, um sich einen Platz bei Odin in Walhalla zu verdienen. \nIm Land der Norska herrschen die alten nordischen Götter der Reisenden, die in den Tempel von Odin, Thor und Freya eintauchen, während der Krieger, der die Prüfung des Kriegers abschließen kann, große Belohnung erwartet. \nNorka Runecasters sind furchterregende Priester. Sie können Walküren gegen Eindringlinge beschwören. Norska-Räuber können auf See in ihren schrecklichen, von Drachen besetzten Langschiffen angetroffen werden. In Norska kann man überall, besonders in der Nähe von Flüssen oder Küsten, Gruppen entdecken-vielleicht sind sie auf dem Weg, um ihre Behausung zu plündern, selbst während Sie dies lesen? \nNorskas sind fast alle, die keine Liebe zu Orks, Imperien oder Witchbanern haben. \nNorska-Händler verkaufen in nördlichen Wäldern, Pelze und Leder, Bernstein und Waffen."
        },
        {
            "content_type": "heading",
            "text": "Bufflokas",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flaggenfarbe (Grün) \nIn den Ebenen und in den Akazien- und Ahornwäldern der Welt können die wandernden Clan-Dörfer der noblen Bufflokas entdeckt werden. Die stolzen und zähen Pferdekrieger jagen Büffel und Biber. Sie bauen Mais und Reis an. Buffloka-Lager bestehen aus Wigwams und Hütten. Durch die große Anzahl von Kriegern, die jedes Lager unterstützt und Verstärkung anfordern können, sind sie so gefährlich. Buffloka-Häuptlinge sind tapfer und schwer zu tötende Krieger. Buffloka-Schamanen haben heilende Fähigkeiten und können Totem-Geister herbeirufen, um ein Dorf zu verteidigen. Buffloka-Händler sind auf Pelz, Leder und Rindsteaks spezialisiert."
        },
        {
            "content_type": "heading",
            "text": "Xoltecs",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flaggenfarbe (Orange) \nXolteken werden in Tafelbergen gefunden, wo Sie in riesigen Zigguraten anzutreffen sind und die Dämonen des Nether, mit Blutopfern verehren. \nXoltec-Siedlungen befinden sich auf dem Mesa-Plateau, wo komplexe Bewässerungssysteme den Anbau von Kulturpflanzen ermöglichen. Sie sind auch erfahrene Bergleute. Xoltec-Siedlungen werden von Minen und Tunneln durchzogen, von denen aus sie die reichhaltigen Adern aus Mineralien und Metallen nutzen. \nDie Xoltecs sind eine Militärgesellschaft mit vielen Kasten von Kriegern, die zu unterschiedlichen Orden gehören. Die Jaguar Knights und Eagle Knights gehören zu den erfahrensten und grausamsten. Xoltec-Waffen bestehen aus Obsidian und können großen Schaden anrichten. \nXoltecs sind insular und werden selten außerhalb ihrer hochkarätigen Mesa gefunden. \nXoltec-Todespriester sind die wahren Herrscher der Xoltec-Gesellschaft und werden sehr gefürchtet. Sie sind mit den Kämpfern ausgestattet, um Eindringlinge anzugreifen und ihre Tempel sind mit Schätzen gefüllt. Xoltecs werden von anderen Stämmen und Reichen wegen ihrer Gewohnheit, Reisende ihren dämonischen Göttern zu opfern, gefürchtet und befinden sich im Krieg mit jedem. \nDie Händler von Xoltec bieten Edelsteine, Obsidian, bunte Farben und die Produkte ihrer intensiven Landwirtschaft an."
        },
        {
            "content_type": "heading",
            "text": "Kongs",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flaggenfarbe (Dunkelgrün) \nDie dampfenden, stinkenden Dschungel werden durch das frenetische Geräusch schlagender Trommeln geweckt, in die Reisende im Stammesland der furchterregenden Kongs geraten. Die Kongs schärfen ihre Zähne, umso besser ihre Opfer (meist sind es Reisende und Abenteurer) beim nächsten Mittagessen zu verspeisen, vielleicht mit Guava-Bohnen und einem schönen Chianti. \nDie Kongs wohnen in Baumhäusern, die zwischen den hohen Ästen großer Dschungelbäume sind. Unachtsame Reisende werden in einem ihrer vielen überdachten Gruben unter ihnen gefangen, die sie als Fallen verwenden. Obwohl über die Kongs wenig bekannt ist, wird von ihnen angeblich ein riesiger Affe angebetet und ihm bei Vollmond Jungfern geopfert. \nDie Kongs sind primitive Krieger und brauchen Bogen und Pfeile um aus der Ferne zu kämpfen. Aber Achtung - manchmal können ihre Pfeile vergiftet sein. \nKong-Schamanen sollen riesige Affen beschwören können und vielleicht können die höchsten und mächtigsten unter ihnen allen ihren schrecklichen Gott selbst beschwören - den König von Kongs! \nKong-Händler sind in Dschungelwäldern anzutreffen und auf Kakao und Leder spezialisiert. Sie haben eine Vorliebe für faules Fleisch jeglicher Art."
        },
        {
            "content_type": "heading",
            "text": "Zimba",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flaggenfarbe (Gelb) \nIn den weiten Savannen, inmitten Herden von Elefanten, Büffeln und Zebras, finden sich die Stammesdörfer der mächtigen Zimba. Obwohl die Zimba als friedliebende Landbevölkerung bekannt ist, gibt es viele talentierte und mutige Krieger. Ihre Leopardenkrieger werden von denen, die ihnen begegnen, sehr gefürchtet. \nDie Zimba können in ihren Dörfern angetroffen werden, ihre Patrouillen können auf der Hochebene der Savanne und der Savanne angetroffen werden. Zimba-Reiter sind flink und ihre Bogenschüsse lang und präzise - sie sind vor Eindringlingen in ihrem Land gut vorbereitet.\nZimba-Hexendoktoren haben heilende Kräfte und können Löwen heraufbeschwören um ihre Krieger gegen Eindringlinge zu unterstützen. \nZimba-Händler sind auf Weizen und Tierfleisch spezialisiert. Sie verlangen Leder und Häute und wie Metalle im Gegenzug."
        },
        {
            "content_type": "heading",
            "text": "The Empire",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flaggenfarbe (Lila) \nDas Imperium ist ewig, es ist die beherrschende Macht in der Welt, seine Städte befinden sich in Wiesen, Birkenwäldern und Obstplantagen. Imperien sind gut besiedelt und reich an Bauernhöfen, Mühlen, Schmieden, Kaufmannshäusern und Kirchen. \nEmpire-Truppen bestehen aus den Empire Guards den Elitekämpfern der Imperator-Legionen und den Empire Knights, deren von Lanzen bewaffnetes, gepanzertes Können von vielen für unbesiegbar gehalten wird. Sie werden von treuen Hellebardisten und Langbogenschützen sowie von berittenen Grenzschutzpferdeschützen unterstützt. \nEmpire Burgen, Außenposten und Türme schützen ihr Land und verfügen über einen scheinbar unerschöpflichen Vorrat an Soldaten. \nDas Imperium ist mit der Hexenbann-Fraktion verbündet und den Wächtern und Nogg-Fraktionen gegenüber neutral. \nEmpire Trader verfügt über eine große Auswahl an Waren und Materialien. Sie akzeptieren jedoch nur anderes Material oder Empire Coins als Gegenleistung."
        },
        {
            "content_type": "heading",
            "text": "Noggs",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flaggenfarbe (Smaragdgrün) \nNogg-Siedlungen sind weit und breit zu finden. Die Nogg sind vielleicht die freundlichsten Menschen, die ein Reisender treffen kann. Die Noggs sind ein Landwirtschafts- und Minenvolk mit einer stolzen Holzfäller-Tradition. Ihre Siedlungen sind meistens befestigte Weiler oder kleine Handelsstädte. \nNoggs haben durchschnittliche Krieger und verlassen sich auf eine reichhaltige Bürgermiliz von Speerkämpfern, Schwertkämpfern und Bogenschützen. Nogg-Adlige, bekannt als Noggins, sind erfahrene Reiter und ihre Gefolgsleute sind Pferdeschützen. \nNogg-Händler verfügen oft über eine große Auswahl an Materialien und Gütern zum Tausch und akzeptieren häufig viele andere Dinge."
        },
        {
            "content_type": "heading",
            "text": "Witchbaners",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flaggenfarbe (Weiß) \nDie Religion des Imperiums ist die Heilige Kirche und bildet eine separate verbündete Fraktion des Imperiums. Immer auf der Suche nach dem Bösen, den Untoten und allen anderen Monstern, ist es nicht möglich, die Tempel und die Anbetungsstätten anderer Götter zu zerstören. In gewissem Sinne ist das Hexenross eine aggressive Kreuzzug der Empires Expansion. Witchbane-Festungen sind normalerweise Schlösser und können bei vielen Verteidigern schwer zu erobern sein. Der militärische Arm der Reichskirche, der die heidnischen Stämme und Nationen erobern und bekehren soll. Sie sind gepanzerte und effiziente Krieger und schwer zu überwinden. \nWitchbane-Priester haben starke heilende Fähigkeiten. Die besten können auch einen Engelskrieger herbeirufen, der ihnen hilft. \nWitchbane-Händler sind auf Bücher, Papier, Federn und Tintenbeutel spezialisiert."
        },
        {
            "content_type": "heading",
            "text": "Sarkonids",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flaggenfarbe (Rot) \nIn brodelnden Wüsten können die Wüstenfestungen der Sarkoniden gefunden werden. Diese heftigen Wüstenkrieger verteidigen entschlossen ihre sonnenverwöhnten Territorien. Sarkoniden sind in abgelegenen Dörfern, Außenposten und in Burgen und ummauerten Städten zu finden. \nSarkoniden sind eine freundliche Nation, versuchen sich aber bei einem Angriff gewaltsam verteidigen. \nSarkonid Emirs sind geschickte und gerissene Kämpfer und aufgrund ihrer Geschwindigkeit schwer zu schlagen. \nSarkoniden-Priester können gefallene Sarkoniden im Kampf wiederbeleben und Wüsten-Dschinns beschwören um ihnen zu helfen. \nSarkonid-Händler haben eine sehr große Auswahl an Materialien und Gegenständen für den Handel."
        },
        {
            "content_type": "heading",
            "text": "Piraten",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flaggenfarbe (ocker) Als das Reich seine Expansion begann und seine Militärkolonien auf der ganzen Welt etabliert, waren die Schiffsflotten die es für den Transport seiner Kolonisten hatte, zahlreich und stark. Aber manchmal meuterten die Besatzungen gegen die strenge und repressive Herrschaft der Empire Captains und so wurde die Piratenbruderschaft geboren. Piraten können auf See in Schiffen oder auf Inselpiratenfestungen angetroffen werden. Piraten nehmen keine Gefangenen, sie wollen nur Beute und Chaos, trinken viel Rum, singen und tanzen über den kalten Leichen ihrer Gegner. Piratenchefs können notorisch schwer zu besiegende Krieger sein und haben magische Waffen und Rüstungen, die von Opfern geplündert wurden. Wahrscheinlich haben sie die Geheimnisse des Schießpulvers längst entdeckt und ihre Schiffe und Festungen gut mit Kanonen ausgestattet. Piratenvoodoo-Priesterinnen haben starke Kräfte und manchmal können sie andere Piraten beschwören, um ihnen zu helfen. Erfolge zu verkaufen - Edelsteine, Gold, Waffen und Artefakte, die sie gegen alle täglichen Dinge wie Holz eintauschen, um ihre Schiffe zu reparieren. Piratenhändler handeln immer mit Schießpulver."
        },
        {
            "content_type": "heading",
            "text": "Brigands",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flaggenfarbe (Braun) \nIn allen Ländern gibt es die, die versuchen, ihre Mitmenschen zu bestehlen, oder den unvorsichtigen Reisenden, um zu stehlen und zu ermorden. Solche Männer sind als Briganten bekannt. Es gibt sie überall und überall an einsamen und isolierten Orten können sie ihre Basis bauen. \nBriganden befinden sich in Zeltlagern, zerstörten Türmen, Höhlen, verlassenen Dörfern und alten Friedhöfen. \nBriganden sind keine harten Krieger, treten jedoch in großer Zahl auf. \nBrigand-Priester sind Ketzer, und auch sie sind in der Lage, ihre eigenen Anhänger zu heilen, sie können auch Giftflaschen auf ihre Feinde werfen. \nBrigand-Händler verkaufen die Gegenstände, die sie von Reisenden plündern und stehlen, um Geld zu bekommen, denn Brigaden sind extrem gierig und Gold ist alles, was sie wollen."
        },
        {
            "content_type": "heading",
            "text": "Orks",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flaggenfarbe (dunkelgrau) \nWenn das Land, wo es unfruchtbar ist oder in längst verlassenen Ruinen und tiefen unterirdischen Gegenden, kann die schreckliche untermenschliche Rasse des Orks gefunden werden.\nDie Orks verehren ihren Erlöser Gott Bhaal Rogh, von dem gesagt wird, dass er ihnen die Tagesordnung über die ganze Welt geben wird. Ork Warlords können unaufhaltsame Krieger sein, die ihre Feinde mit brachialer Gewalt, kraftvollen Schlägen und der Fähigkeit, Schaden zu absorbieren, zerstören. Berserker Orks sind grausam und tödlich, führen zwei Waffen im Angriff, während die Bogenschützen der Orks hinterlistig sind und beim Überfall häufig Feuerpfeile verwenden. \nOrks hassen alle anderen gleichermaßen, haben aber einen besonderen Widerwillen gegen Reiter und Pferde, die sie auf Anhieb immer angreifen werden. \nOrk-Händler handeln mit Metallen und Steinen gegen tierisches oder verrottetes Fleisch."
        },
        {
            "content_type": "heading",
            "text": "Dämonen",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flaggenfarbe (Scharlachrot) \nIn den dunklen Regionen jenseits der realen Welt, die als Nether bekannt sind, lauern dunkle Mächte und warten auf ihre Chance, erneut in die Welt der Menschen einzudringen. Diese Wesen sind als Dämonen bekannt - Kreaturen des üblen Bösen und Chaos, Kreaturen aus Feuer, Rauch und Schwefel. \nDie Abenteurer sollten sich davor hüten, dämonische Portale in ihren Netherstädten zu finden, oder vor Zauberern und Dunklen Lords, die sie für eine begrenzte Zeit herbeirufen können, um ihre Gebote in der Welt der Menschen zu erledigen."
        },
        {
            "content_type": "heading",
            "text": "Undead",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flaggenfarbe (hellgrau) \nIn verfallenen verlassenen Gräbern, in alten Krypten und Mausoleen, in versiegelten Gewölben mit zerbröckelnden Verdigris-Türen und längst vergessenen Friedhöfen werden die unruhigen Toten verweilen und bleiben. In verlassenen antiken Orten, verborgen im Dunkeln, schreien und schwärmen Herrscher und Geisterkönige, Wraith Lords und die noch lebenden Mumien der Menschen, die einst aus längst verschwundenen Imperien waren, mit ihren lebenden Schiffen, die zu Krieg führten. \nUndead Krieger können nur schwer zu schlagen sein, aber ihre Schwäche gegenüber den Sonnenstrahlen und Gold- und Silberwaffen kann ihr Verderben sein."
        },
        {
            "content_type": "heading",
            "text": "Die Malice",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flaggenfarbe (Schwarz) \nIn dunklen Wäldern, gärenden Sümpfen, brütenden Ruinen und tiefen, lichtlosen unterirdischen Höhlen schmieden die Malice Pläne, die Welt zu zerstören. Die Kreaturen von Malice sind überall zu finden. Zauberer, Schwarze Ritter, Killer-Clowns, Diener des Bösen, Besitzervogelscheuchen, Kultisten, Vampirlords, Wights, Specters und Wraiths warten auf den unglücklichen Abenteurer. \nMalice-Kreaturen können in verwunschenen oder zerstörten Burgen, in den Hochburgen der Vampir Lords und in den Brachen der Dark Lords gefunden werden. \nBöswillige Zauberer und Dunkle Lords können Dämonen aus dem Nether beschwören. Boshafte Tempel und Gräber können von Wächtern, Monstern, Fallen und Tricks heimgesucht werden. \nDie Malice befinden sich im Krieg mit allen, sind aber häufig mit den Fraktionen Dämonen, Orks und Untoten verbündet. Aber ihre Preise sind hoch und werden mit Blut bezahlt."
        },
        {
            "content_type": "heading",
            "text": "Die Guardians",
            "level": 2
        },
        {
            "content_type": "text",
            "text": "Flaggenfarbe (Hellgrün) \nZum Kampf gegen die Bosheit haben sich viele Kräfte des Guten zusammengetan und verbündet, um ihre bösen Pläne zur Herrschaft zu vereiteln. Elfen der Urwälder, Waldwächter des Nordens, Questing Krieger, Druiden und Zauberer werden immer dem müden Reisenden helfen, der von der Malice bedroht wird. \nGuardianische Händler werden nützliche Gegenstände und Tränke für Abenteurer auf Lager halten und im Gegenzug nach Nahrung, Waffen und Münzen fragen."
        }
    ]
}